app/views/quotes/_form.html.erb

SELECT "authors".* FROM "authors"
---
      <%= form.label :author_id, "Author", class: "form-label d-inline-block me-2" %>
      <%= form.select :author_id, Author.all.collect {|auth| [auth.authName, auth.id]}, {include_blank: true}, class: "form-control d-inline-block" %>

SELECT "categories".* FROM "categories"
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
---
    <div id="categories-container">
        <% @quote.quote_categories.each do |quote_category| %>

SELECT "categories".* FROM "categories"
---
              <%= qc.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
              <%= qc.select :category_id, Category.all.collect {|cat| [cat.categoryName, cat.id]}, {include_blank: true}, class: "form-control d-inline-block" %>