app/views/quotes/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <div class "form-group" style="padding-bottom: 10px">
      <%= form.select :author_id, Author.all.collect {|auth| [auth.authName, auth.author_id]}, {include_blank: true}, class: "form-control d-inline-block" %>