app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def current_user #returns the user who is currently logged in
        @current_user ||= User.find_by(id: session[:user_id])