app/controllers/authors_controller.rb

INSERT INTO "authors" ("authByear", "authDyear", "biography", "created_at", "updated_at", "authName") VALUES (?, ?, ?, ?, ?, ?)  [["authByear", ""], ["authDyear", ""], ["biography", ""], ["created_at", "2024-10-16 04:21:18.945929"], ["updated_at", "2024-10-16 04:21:18.945929"], ["authName", "Author unknown"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save