app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("authByear", "authDyear", "biography", "created_at", "updated_at", "authName") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "authByear" = ?, "authDyear" = ?, "biography" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["authByear", "563BC"], ["authDyear", "480BC"], ["biography", ""], ["updated_at", "2024-10-16 09:26:36.144056"], ["id", 1]]