app/controllers/home_controller.rb

  def index
    # queries the database for the 5 most recent PUBLIC quotes, along with their respective category "Recent Added Quotes" feature.
    @quotes = Quote.includes(:user, :author, :categories)
                   .select("users.fname, authors.*, quote_categories.*, quotes.*, categories.*")
                   .where(isQuotePublic: true)
                   .references(:user, :author, :categories)
                   .order(created_at: :desc)
                   .take(5)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (?, ?)  [["id", 3], ["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 2], ["id", 4], ["id", 6]]
SELECT users.fname, authors.*, quote_categories.*, quotes.*, categories.*, "quotes"."id" AS t0_r0, "users"."id" AS t1_r0, "users"."fname" AS t1_r1, "users"."lname" AS t1_r2, "users"."email" AS t1_r3, "users"."password_digest" AS t1_r4, "users"."isAdmin" AS t1_r5, "users"."status" AS t1_r6, "users"."created_at" AS t1_r7, "users"."updated_at" AS t1_r8, "authors"."id" AS t2_r0, "authors"."authByear" AS t2_r1, "authors"."authDyear" AS t2_r2, "authors"."biography" AS t2_r3, "authors"."created_at" AS t2_r4, "authors"."updated_at" AS t2_r5, "authors"."authName" AS t2_r6, "categories"."id" AS t3_r0, "categories"."categoryName" AS t3_r1, "categories"."created_at" AS t3_r2, "categories"."updated_at" AS t3_r3 FROM "quotes" LEFT OUTER JOIN "users" ON "users"."id" = "quotes"."user_id" LEFT OUTER JOIN "authors" ON "authors"."id" = "quotes"."author_id" LEFT OUTER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quotes"."isQuotePublic" = ? AND "quotes"."id" IN (?, ?) ORDER BY "quotes"."created_at" DESC  [["isQuotePublic", 1], ["id", 3], ["id", 2]]

  def uquotes
    #get all quotes, along with their author and related categories for the currently logged in user
    @quotes = Quote.includes(:user, :author, :categories)
                   .select("users.fname, authors.*, quote_categories.*, quotes.*, categories.*")
                   .where(user_id: session[:user_id])
                   .references(:user, :author, :categories)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 10], ["id", 2], ["id", 4], ["id", 6]]
SELECT users.fname, authors.*, quote_categories.*, quotes.*, categories.*, "quotes"."id" AS t0_r0, "users"."id" AS t1_r0, "users"."fname" AS t1_r1, "users"."lname" AS t1_r2, "users"."email" AS t1_r3, "users"."password_digest" AS t1_r4, "users"."isAdmin" AS t1_r5, "users"."status" AS t1_r6, "users"."created_at" AS t1_r7, "users"."updated_at" AS t1_r8, "authors"."id" AS t2_r0, "authors"."authByear" AS t2_r1, "authors"."authDyear" AS t2_r2, "authors"."biography" AS t2_r3, "authors"."created_at" AS t2_r4, "authors"."updated_at" AS t2_r5, "authors"."authName" AS t2_r6, "categories"."id" AS t3_r0, "categories"."categoryName" AS t3_r1, "categories"."created_at" AS t3_r2, "categories"."updated_at" AS t3_r3 FROM "quotes" LEFT OUTER JOIN "users" ON "users"."id" = "quotes"."user_id" LEFT OUTER JOIN "authors" ON "authors"."id" = "quotes"."author_id" LEFT OUTER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quotes"."user_id" = ?  [["user_id", 6]]