app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("quoteText", "yearOfPublication", "comment", "isQuotePublic", "user_id", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "quoteText" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["quoteText", "My friends, judge me by the enemies I have made."], ["updated_at", "2024-10-16 09:54:58.876036"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)