app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("quoteText", "yearOfPublication", "comment", "isQuotePublic", "user_id", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "yearOfPublication" = ?, "isQuotePublic" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["yearOfPublication", ""], ["isQuotePublic", 1], ["updated_at", "2024-10-16 04:35:30.033611"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)