app/controllers/search_controller.rb

SELECT DISTINCT users.fname, authors.*, quote_categories.*, quotes.*, categories.*, "quotes"."id" AS t0_r0, "users"."id" AS t1_r0, "users"."fname" AS t1_r1, "users"."lname" AS t1_r2, "users"."email" AS t1_r3, "users"."password_digest" AS t1_r4, "users"."isAdmin" AS t1_r5, "users"."status" AS t1_r6, "users"."created_at" AS t1_r7, "users"."updated_at" AS t1_r8, "authors"."id" AS t2_r0, "authors"."authByear" AS t2_r1, "authors"."authDyear" AS t2_r2, "authors"."biography" AS t2_r3, "authors"."created_at" AS t2_r4, "authors"."updated_at" AS t2_r5, "authors"."authName" AS t2_r6, "quote_categories"."id" AS t3_r0, "quote_categories"."quote_id" AS t3_r1, "quote_categories"."category_id" AS t3_r2, "quote_categories"."created_at" AS t3_r3, "quote_categories"."updated_at" AS t3_r4, "categories"."id" AS t4_r0, "categories"."categoryName" AS t4_r1, "categories"."created_at" AS t4_r2, "categories"."updated_at" AS t4_r3 FROM "quotes" LEFT OUTER JOIN "users" ON "users"."id" = "quotes"."user_id" LEFT OUTER JOIN "authors" ON "authors"."id" = "quotes"."author_id" LEFT OUTER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (quotes.isQuotePublic = true AND categories.categoryName LIKE '%Axiology%')
---
  def index
    # query returns all quotes that are linked to a searched category. Frontend implementation is found in app/views/search/index.html.erb
    category_query = params[:category_query]
      if category_query.present?
        @quote_match = Quote.joins(:author, :quote_categories, categories).where("categories.categoryName LIKE ?", "%#{category_query}%").distinct